In [1]:
import pandas as pd
import numpy as np

In [ ]:
# dir(pd)

### Making a DataFrame from List of List
Syntax - pd.DataFrame(
    data=None,
    index: 'Axes | None' = None,
    columns: 'Axes | None' = None,
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
) -> 'None'

In [2]:
e1_data = [
    [100,'Tom','Mgr'],
    [200,'Mary','Pgmr'],
    [300,'Jon','Clrk']
]

In [3]:
emp_df = pd.DataFrame(data = e1_data)

In [4]:
print(emp_df)

     0     1     2
0  100   Tom   Mgr
1  200  Mary  Pgmr
2  300   Jon  Clrk

In [5]:
emp_df2 = pd.DataFrame(data = e1_data, columns = ['Eid','Ename','Job'])

In [6]:
print(emp_df2)

   Eid Ename   Job
0  100   Tom   Mgr
1  200  Mary  Pgmr
2  300   Jon  Clrk

In [11]:
emp_df3 = pd.DataFrame(data = e1_data, columns = ['Eid','Ename','Job'], index = ['E1','E2','E3'] )

In [9]:
print(emp_df3)

    Eid Ename   Job
E1  100   Tom   Mgr
E2  200  Mary  Pgmr
E3  300   Jon  Clrk

In [10]:
type(emp_df)

pandas.core.frame.DataFrame

## Creating Same DataFrame using dictionary

In [12]:
e2_data = {
    'Eid':[100,200,300],
    'EName':['Tom','Mary','Jon'],
    'Job':['Mgr','Pgmr',"clrk"]    
          }

In [13]:
edict_df = pd.DataFrame(e2_data, index = ['E1','E2','E3'])

In [14]:
edict_df

    Eid EName   Job
E1  100   Tom   Mgr
E2  200  Mary  Pgmr
E3  300   Jon  clrk

In [15]:
type(edict_df)

pandas.core.frame.DataFrame

### Load Data From a .csv file 
using the method 
#### pd.read_csv()

In [16]:
univ = pd.read_csv('datasets/Universities.csv')

In [17]:
univ

            Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0          Brown  1310     89      22       13     22704        94
1        CalTech  1415    100      25        6     63575        81
2            CMU  1260     62      59        9     25026        72
3       Columbia  1310     76      24       12     31510        88
4        Cornell  1280     83      33       13     21864        90
5      Dartmouth  1340     89      23       10     32162        95
6           Duke  1315     90      30       12     31585        95
7     Georgetown  1255     74      24       12     20126        92
8        Harvard  1400     91      14       11     39525        97
9   JohnsHopkins  1305     75      44        7     58691        87
10           MIT  1380     94      30       10     34870        91
11  Northwestern  1260     85      39       11     28052        89
12     NotreDame  1255     81      42       13     15122        94
13     PennState  1081     38      54       18     10185        80
14     Princeton  1375     91      14        8     30220        95
15        Purdue  1005     28      90       19      9066        69
16      Stanford  1360     90      20       12     36450        93
17      TexasA&M  1075     49      67       25      8704        67
18    UCBerkeley  1240     95      40       17     15140        78
19      UChicago  1290     75      50       13     38380        87
20     UMichigan  1180     65      68       16     15470        85
21         UPenn  1285     80      36       11     27553        90
22           UVA  1225     77      44       14     13349        92
23    UWisconsin  1085     40      69       15     11857        71
24          Yale  1375     95      19       11     43514        96

## Examine the Data

In [19]:
type(univ)

pandas.core.frame.DataFrame

#### First 3 Records

In [20]:
univ.head(3)

      Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0    Brown  1310     89      22       13     22704        94
1  CalTech  1415    100      25        6     63575        81
2      CMU  1260     62      59        9     25026        72

#### Last 3 Records

In [21]:
univ.tail(3)

          Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
22         UVA  1225     77      44       14     13349        92
23  UWisconsin  1085     40      69       15     11857        71
24        Yale  1375     95      19       11     43514        96

### To get the genral information about the DataFrame

In [22]:
univ.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Univ      25 non-null     object
 1   SAT       25 non-null     int64
 2   Top10     25 non-null     int64
 3   Accept    25 non-null     int64
 4   SFRatio   25 non-null     int64
 5   Expenses  25 non-null     int64
 6   GradRate  25 non-null     int64
dtypes: int64(6), object(1)
memory usage: 1.5+ KB

#### Gives the Description of Numerical columns of DataFrame which includes :-
1. count - The number of not-empty values.
2. mean - The average (mean) value. 
3. std - The standard deviation. 
4. min - the minimum value.
5. 25% - The 25% percentile.
6. 50% - The 50% percentile. 
7. 75% - The 75% percentile.
8. max - the maximum value.

In [24]:
print(univ.describe())

               SAT       Top10     Accept   SFRatio      Expenses   GradRate
count    25.000000   25.000000  25.000000  25.00000     25.000000  25.000000
mean   1266.440000   76.480000  39.200000  12.72000  27388.000000  86.720000
std     108.359771   19.433905  19.727308   4.06735  14424.883165   9.057778
min    1005.000000   28.000000  14.000000   6.00000   8704.000000  67.000000
25%    1240.000000   74.000000  24.000000  11.00000  15140.000000  81.000000
50%    1285.000000   81.000000  36.000000  12.00000  27553.000000  90.000000
75%    1340.000000   90.000000  50.000000  14.00000  34870.000000  94.000000
max    1415.000000  100.000000  90.000000  25.00000  63575.000000  97.000000

In [25]:
udf = pd.read_csv('datasets/Universities.csv',index_col = 'Univ')

In [27]:
print(udf)

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown         1310     89      22       13     22704        94
CalTech       1415    100      25        6     63575        81
CMU           1260     62      59        9     25026        72
Columbia      1310     76      24       12     31510        88
Cornell       1280     83      33       13     21864        90
Dartmouth     1340     89      23       10     32162        95
Duke          1315     90      30       12     31585        95
Georgetown    1255     74      24       12     20126        92
Harvard       1400     91      14       11     39525        97
JohnsHopkins  1305     75      44        7     58691        87
MIT           1380     94      30       10     34870        91
Northwestern  1260     85      39       11     28052        89
NotreDame     1255     81      42       13     15122        94
PennState     1081     38      54       18     10185        80
Princeton     1375     91      14        8     30220        95
Purdue        1005     28      90       19      9066        69
Stanford      1360     90      20       12     36450        93
TexasA&M      1075     49      67       25      8704        67
UCBerkeley    1240     95      40       17     15140        78
UChicago      1290     75      50       13     38380        87
UMichigan     1180     65      68       16     15470        85
UPenn         1285     80      36       11     27553        90
UVA           1225     77      44       14     13349        92
UWisconsin    1085     40      69       15     11857        71
Yale          1375     95      19       11     43514        96

In [28]:
print(udf.columns)

Index(['SAT', 'Top10', 'Accept', 'SFRatio', 'Expenses', 'GradRate'], dtype='object')

### Access Data

### access rows of the DataFrame

In [29]:
udf.loc['Stanford']

SAT          1360
Top10          90
Accept         20
SFRatio        12
Expenses    36450
GradRate       93
Name: Stanford, dtype: int64

### To know at which location within the index list, a particular index is located :- The similar way works for columns too

In [38]:
udf.index.get_loc('Stanford')

16

In [39]:
udf.iloc[udf.index.get_loc('Stanford')]

SAT          1360
Top10          90
Accept         20
SFRatio        12
Expenses    36450
GradRate       93
Name: Stanford, dtype: int64

In [40]:
udf.iloc[2:7]

            SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CMU        1260     62      59        9     25026        72
Columbia   1310     76      24       12     31510        88
Cornell    1280     83      33       13     21864        90
Dartmouth  1340     89      23       10     32162        95
Duke       1315     90      30       12     31585        95

In [41]:
udf.loc['CMU':'Duke']

            SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CMU        1260     62      59        9     25026        72
Columbia   1310     76      24       12     31510        88
Cornell    1280     83      33       13     21864        90
Dartmouth  1340     89      23       10     32162        95
Duke       1315     90      30       12     31585        95

In [48]:
# dir(pd.DataFrame)

### Boolean Selection :- Condition based selection

In [49]:
condition = udf['Expenses']>40000

#### Only those entries are returned which True values corrosponding to the condition

In [50]:
udf[condition]

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CalTech       1415    100      25        6     63575        81
JohnsHopkins  1305     75      44        7     58691        87
Yale          1375     95      19       11     43514        96

#### Selection can also be based on 2 or more conditions, but they have to be combined using the 'Binary operations :- 
### a. & :- for and 
### b. | :- for or

In [51]:
condition1 = (udf['Expenses']>40000) & (udf['Top10'] > 90)

In [52]:
udf[condition1]

          SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CalTech  1415    100      25        6     63575        81
Yale     1375     95      19       11     43514        96

In [53]:
condition2 = (udf['Expenses']>40000) | (udf['Top10'] > 90)

In [54]:
udf[condition2]

               SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
CalTech       1415    100      25        6     63575        81
Harvard       1400     91      14       11     39525        97
JohnsHopkins  1305     75      44        7     58691        87
MIT           1380     94      30       10     34870        91
Princeton     1375     91      14        8     30220        95
UCBerkeley    1240     95      40       17     15140        78
Yale          1375     95      19       11     43514        96

### Accessing Columns

#### 1.access all the entries for a single column by column label

In [55]:
udf['SAT']

Univ
Brown           1310
CalTech         1415
CMU             1260
Columbia        1310
Cornell         1280
Dartmouth       1340
Duke            1315
Georgetown      1255
Harvard         1400
JohnsHopkins    1305
MIT             1380
Northwestern    1260
NotreDame       1255
PennState       1081
Princeton       1375
Purdue          1005
Stanford        1360
TexasA&M        1075
UCBerkeley      1240
UChicago        1290
UMichigan       1180
UPenn           1285
UVA             1225
UWisconsin      1085
Yale            1375
Name: SAT, dtype: int64

#### 2.Access all the entries two or more than two columns by column labels

In [56]:
udf[['SAT','Expenses']]

               SAT  Expenses
Univ
Brown         1310     22704
CalTech       1415     63575
CMU           1260     25026
Columbia      1310     31510
Cornell       1280     21864
Dartmouth     1340     32162
Duke          1315     31585
Georgetown    1255     20126
Harvard       1400     39525
JohnsHopkins  1305     58691
MIT           1380     34870
Northwestern  1260     28052
NotreDame     1255     15122
PennState     1081     10185
Princeton     1375     30220
Purdue        1005      9066
Stanford      1360     36450
TexasA&M      1075      8704
UCBerkeley    1240     15140
UChicago      1290     38380
UMichigan     1180     15470
UPenn         1285     27553
UVA           1225     13349
UWisconsin    1085     11857
Yale          1375     43514

#### 3.Access The specific columns for a particular row by it's location in index and columns list using iloc()

In [59]:
udf.iloc[2,[2,3,5]]

Accept      59
SFRatio      9
GradRate    72
Name: CMU, dtype: int64

#### 4.Access Specific specific rows and columns by its position using ' iloc() '

In [60]:
udf.iloc[[2,3,4],[2,3,5]]

          Accept  SFRatio  GradRate
Univ
CMU           59        9        72
Columbia      24       12        88
Cornell       33       13        90

#### 5.Access specific columns for all the entries in the DataFrame

In [58]:
udf.iloc[:,[2,3,5]]

              Accept  SFRatio  GradRate
Univ
Brown             22       13        94
CalTech           25        6        81
CMU               59        9        72
Columbia          24       12        88
Cornell           33       13        90
Dartmouth         23       10        95
Duke              30       12        95
Georgetown        24       12        92
Harvard           14       11        97
JohnsHopkins      44        7        87
MIT               30       10        91
Northwestern      39       11        89
NotreDame         42       13        94
PennState         54       18        80
Princeton         14        8        95
Purdue            90       19        69
Stanford          20       12        93
TexasA&M          67       25        67
UCBerkeley        40       17        78
UChicago          50       13        87
UMichigan         68       16        85
UPenn             36       11        90
UVA               44       14        92
UWisconsin        69       15        71
Yale              19       11        96

### 6.access all the entries for a single column by column position usng iloc

In [61]:
udf.iloc[:,2]

Univ
Brown           22
CalTech         25
CMU             59
Columbia        24
Cornell         33
Dartmouth       23
Duke            30
Georgetown      24
Harvard         14
JohnsHopkins    44
MIT             30
Northwestern    39
NotreDame       42
PennState       54
Princeton       14
Purdue          90
Stanford        20
TexasA&M        67
UCBerkeley      40
UChicago        50
UMichigan       68
UPenn           36
UVA             44
UWisconsin      69
Yale            19
Name: Accept, dtype: int64

## Cleaning Data
1. Look for Null Value
-- Ways handling null value


a. Delete nulls :- Last option


b. Imputation :- Replacing Nulls 
How to handle 'null' values, generally
- for numerical value replace it with 'average' values
- for categorical values replace it with 'mode' values i.e.Most Probable Values
2. Look for Duplicates Value
3. Rename column
4. Change Data Types

### Handling Null

### In Pandas to use null we have to use np.nan

In [ ]:
dnull = [[1,2,3,'M',7],[np.nan,6,7,8,8],[np.nan,5,6,'M',7],
         [8,np.nan,9,'F',10],[np.nan,np.nan,np.nan,'M',11]
        ]

In [ ]:
dframe = pd.DataFrame(dnull,columns = ['a','b','c','d','e'])

In [ ]:
dframe

### Drop records with null values

#### Default drop 'na' is along the row

In [ ]:
dframe.dropna()

#### To drop along columns we have to specify axis = 1

In [ ]:
dframe.dropna(axis = 1)

## To Change orignal data Frame we have to use (inplace = True)

In [ ]:
dframe.dropna(axis = 1, inplace = True)

In [ ]:
dframe

### To have both the orignal DataFrame and DataFrame with dropped null value

In [ ]:
dframe = pd.DataFrame(dnull, columns = ['a','b','c','d','e'])

In [ ]:
dnona = dframe.dropna()

In [ ]:
dframe

In [ ]:
dnona

## Replace null Values

### 1.Rarely Used

In [ ]:
dframe.fillna(0)

### use Dictionary to replace column specific null value

In [ ]:
dframe.fillna(
    {'a':10,'b':100,'c':1000,'e':10000}
)

### Use mean() for numerical columns

In [ ]:
avg_a = dframe['a'].mean()

In [ ]:
avg_b = dframe['b'].mean()

In [ ]:
avg_c = dframe['c'].mean()

In [ ]:
avg_a,avg_b,avg_c

In [ ]:
dframe.fillna(
    {'a':avg_a,'b':avg_b,'c':avg_c}
)

### Use mode() - most frequently occuring for character column

In [ ]:
dframe['d'].mode()

In [ ]:
mode_d = dframe['d'].mode()[0]

In [ ]:
dframe.fillna(
    {'d':mode_d},
    #inplace=True
)

## Droping a Column -- Label has to be specified

In [ ]:
d1= [[1,2,3],[4,5,6],[7,8,9]]

In [ ]:
df = pd.DataFrame(d1,columns = ['pop','year','num'], index = ['SF',"LA","NY"])

In [ ]:
df

### Drop row

In [ ]:
df.drop('LA')

## Drop column

In [ ]:
df.drop('year',axis = 1)

### To make anyone of above permanent to DataFrame use 
(inplace = True)

In [ ]:
df_withoutnull = df.copy()

## Duplicates

In [ ]:
ddup = pd.DataFrame({'col1':['A','A','B','B','B'],'col2':[2,2,2,3,3]})

In [ ]:
ddup

### Mark record Duplicate or Not

In [ ]:
ddup.duplicated()

## Drops the Duplicates

In [ ]:
ddup.drop_duplicates()

### inplace modification

In [ ]:
ddup.drop_duplicates(inplace = True)

In [ ]:
ddup

### Rename Columns

In [ ]:
df = pd.DataFrame(d1,columns = ['pop','year','num'], index = ['SF',"LA","NY"])

In [ ]:
df.rename(columns = {'pop':'popu','num':'count'},inplace=True)

In [ ]:
df

# Data Analysis

In [ ]:
d1 = [[1,2,3],[4,5,6]]

In [ ]:
df1 = pd.DataFrame(d1,columns = ['a','b','c'])

In [ ]:
df1

In [ ]:
d2 = [[10,20,30],[40,50,60]]

In [ ]:
df2 = pd.DataFrame(d2,columns = ['e','f','g'])

In [ ]:
df2

In [ ]:
d3 = [[110,220,330],[440,550,660]]

In [ ]:
df3 = pd.DataFrame(d3,columns = ['a','b','c'])

In [ ]:
df3

### concat()

In [ ]:
pd.concat((df1,df3))

## join() :- equivalent to merge in Database (SqL)

In [ ]:
df1.join(df2)

# Merge()

In [ ]:
d2 = {
    'movieid':[1,2,3,4],
    'name' : ['Tom','Tim','Jan','Jin'],
    'movieid':[1,np.nan,3,5]
    
     }

## Groupby()

In [ ]:
sal = pd.read_csv('datasets/Salaries.csv')

In [ ]:
sal.head()

In [ ]:
sal['rank'].unique()

In [ ]:
sal['rank'].value_counts()

In [ ]:
sal['sex'].value_counts()

In [ ]:
grp = sal.groupby('rank')

In [ ]:
for x,y in grp:
    print(x)
    print('_'*50)

In [ ]:
for x,y in grp:
    print(x)
    print(y)
    print('_'*55)

In [ ]:
grp.get_group('AssocProf')

In [ ]:
grp.agg('mean').round(2)

In [ ]:
grp.agg('mean','min','max').round(2)

In [ ]:
sal_nr = sal[['rank','phd','salary','service']]

In [ ]:
sal_nr.head()

In [ ]:
grp_nr =sal_nr.groupby('rank')

In [ ]:
grp_nr.agg('mean').round(2)

In [ ]:
grp_nr.agg('mean','min','max').round(2)

## Sorting Records

In [ ]:
udf.head()

In [ ]:
udf['Expenses']

In [ ]:
udf['Expenses'].sort_values(ascending=False)

In [ ]:
udf['Expenses'].sort_index(ascending=False)

In [ ]:
udf.sort_values(by='Expenses', ascending = False)

In [ ]:
sal.sort_values(['rank','sex'], ascending = [False,False])